server/app/controllers/cattles_controller.rb

  def index
    @cattles = Cattle.all
---
SELECT * FROM `cattles`

  def show
    @cattle = Cattle.find(params[:id])
---
SELECT * FROM `cattles` WHERE (`cattles`.`id` = 1)