server/app/controllers/tasks_controller.rb

SELECT * FROM `tasks`
---
  def index
    @tasks = Task.all

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 7)
---
  def show
    @task = Task.find(params[:id])

SELECT * FROM `tasks` WHERE (`tasks`.job_id = 1)
---
  def list
    @tasks = Job.find(params[:id]).tasks